[{"registeredName":"一般社団法人UDDOG O UDDOKTA JAPAN","englishName":"Uddog of Uddokta Japan Association","OrganizingDay":"01 January 2020","CharterDay":"18 December 2020","RegistrationNo":"0111-05-009635","Location":"Tokyo, Japan ","NatureOfOrganization":"A social organization in Japan to promote and support  entrepreneurship management, success and sustainability. ","LegalEntity":"Registered as Ippan shadan hojin ( 一般社団法人 = general incorporated association) in Japan ","Vision":"To accumulate entrepreneurs for sustainable accomplishments","Mission":"To assist on building knowledge and skills about entrepreneurship.To enrich the capability of entrepreneurs through research, regular training programs, seminars, counseling & relevant activities To ensure the proper combination of theoretical study and practical business operation To solve contemporary social issues, and to assure creative social enterprise . To provide all sort of possible supports to transform failure entrepreneurs into success","BeneficiaryGroups":"1. Any foreign nationals who want to start a business in Japan. 2. Japanese people who want to invest in foreign startups or to contribute in achieving SDG Goals. 3. Who want to do business from their home country with Japan. 4. Unprivileged communities in developing or underdeveloped countries, to help them become micro entrepreneurs","MajorServices":"Knowledge Support Research, Training, Seminar, Individual Counseling to make entrepreneurs become efficient and successful. To work with various authorities to increase the scope of entrepreneurship learning and practice.Financial Support To arrange capital support for entrepreneurship startups, stand ups and stays ups. Accumulating funds from various sources, aiming for entrepreneurship development. Distributing the funds among the entrepreneurs for their development. Increasing funding by entrepreneurship activities.Sustainable Development Support To assist in business operation, decision making, strategic development and ensure the use of modern business techniques for business sustainability, as well as to guide the entrepreneurs to operate businesses without creating any harmful impact on the society to ensure sustainable social development.","SpecificServicefortheMembers":"Delivering training on entrepreneurship/business Individual counseling to the entrepreneurs Supporting newcomers to make all necessary documents for starting business in Japan Provide legal counseling for business operations in Japan Rendering help in business fund/capital sourcing Regular counseling & training on capital management Help to enhance the eligibility of the workers Render help in accounts management in business Regular supervision for the continuity of the profit of the business Assuring the benefit of using technology & modern/updated business policy Joint effort for market development for sustainable benefits"}]